app/controllers/api/battles_controller.rb

    def create
        @battle = Battle.new()
        @battle.player_id = current_user.id
        if @battle.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "battles" ("player_id") VALUES ($1) RETURNING "player_id"  [["player_id", 20]]

    def show
        @battle = Battle.find_by(id: params[:id])
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]