app/controllers/api/dungeons_controller.rb

INSERT INTO "dungeons" ("player_id", "room_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 1], ["room_amount", 5], ["created_at", "2022-02-24 18:02:36.926853"], ["updated_at", "2022-02-24 18:02:36.926853"]]
---
    def create
        @dungeon = Dungeon.new(dungeon_params)
        @dungeon.player_id = current_user.id
        if @dungeon.save!

SELECT  "dungeons".* FROM "dungeons" WHERE "dungeons"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @dungeon = Dungeon.find_by(id: params[:id])

SELECT "dungeons".* FROM "dungeons"
---
    def index
        @dungeons = Dungeon.all

SELECT  "dungeons".* FROM "dungeons" WHERE "dungeons"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "dungeons" SET "current_room" = $1, "updated_at" = $2 WHERE "dungeons"."id" = $3
---
    def update
        @dungeon = Dungeon.find_by(id: params[:id])

        if @dungeon.update(patch_dungeon_params)