app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "hasDungeon" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["hasDungeon", true], ["updated_at", "2022-02-28 21:10:21.032145"], ["id", 1]]
---
    def update
        @user = User.find_by(id: params[:id])

        if @user.update(update_user_params)